<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Downloads the latest Network Share Mounter pkg from the GitLab releases API.</string>
	<key>Description</key>
	<string>Downloads the latest version of Network Share Mounter.</string>
	<key>Identifier</key>
	<string>com.davincid.download.NetworkShareMounter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Network Share Mounter</string>
		<key>RELEASE_CHANNEL</key>
		<string>release</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://gitlab.rrze.fau.de/api/v4/projects/506/releases</string>
				<key>re_pattern</key>
				<string>(?P&lt;pkg_url&gt;https://gitlab\.rrze\.fau\.de/api/v4/projects/506/packages/generic/networksharemounter/%RELEASE_CHANNEL%-(?P&lt;version&gt;\d+(?:\.\d+)*(?:[A-Za-z0-9]+)?)(?:-[A-Za-z0-9]+)?/(?P&lt;filename&gt;NetworkShareMounter(?:-Beta)?-(?P=version)\.pkg))</string>
				<key>result_output_var_name</key>
				<string>pkg_url</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%pkg_url%</string>
				<key>filename</key>
				<string>%filename%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Universitaet Erlangen-Nuernberg RRZE (C8F68RFW4L)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
