<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of ScreenConnect Client.</string>
	<key>Identifier</key>
	<string>com.davincid.download.ScreenConnectClient</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>DaVinci Digital ScreenConnect Client</string>
		<key>NAME</key>
		<string>ScreenConnect Client</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://screenconnect.davincid.com/Bin/ScreenConnect.Client.zip?h=screenconnect.davincid.com&amp;p=8041&amp;k=BgIAAACkAABSU0ExAAgAAAEAAQDPVmntezWE1w3Ja47SR3Z4IuJYXXfElgKKVLXWkD92V2af0wUSCxE4sSoev701iQcV5SHACsTyGFd1PXA9aHYOotdUSjFG%2Bw6Od4Z2Sp1XQdJ5XCmiUZqJG9yiL3%2B3jMWK3BZz1q3bvClKOrtWRBoXKv8rTTxKH4YJsHF8UKnyDSPl8YsyhtXQe0bHU9feYcOxzg%2BNvAeM8FBAjC2zVaS8rro2EXquXE9RacQb3Qp5d88KrRyi6NYt53DcR0P0s%2FyRhrInQ5%2FMJXhd0IwE5Ew5D06d%2BjMZlwsAsj7S%2F5%2BAC35txIGy0fNbDj2smBX38FObeFMKLcg9BbRxYuYR9Zvn&amp;s=94f52a54-9aa4-4063-9441-9e0c9199df74&amp;i=KGUTILITY&amp;e=Access&amp;y=Host&amp;n=BNyAm3lmxkGjiOCauoPOuG2mNUKutQijtJPyqizr6F17Yx1F%2FVnZZYp2xi2Z8RQViiIYzrZGOdMBN4Mb%2Flo7fKQjiTLL4m%2FdSFR29Vs1vdffGmgFgB0eVaPhlW5uze6vZ132fO9ozlQFmSGAg81QiMC9ji4AB3EXVvSx%2BiSnVMm9&amp;a=None</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/DaVinci Digital ScreenConnect Client.app</string>
				<key>requirement</key>
				<string>identifier "com.screenconnect.client" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = K8M3XDZV9Y</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/DaVinci Digital ScreenConnect Client.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
	</array>
</dict>
</plist>
